#ifndef _ZFY_TCP_SERVER_H_
#define _ZFY_TCP_SERVER_H_

#ifdef	__cplusplus
#if		__cplusplus
extern "C" {
#endif
#endif


#include "Common.h"


typedef struct _CLOAD_PLAT_CONF
{
	const char				*strCloadServerIP;
	unsigned short int		CloadServerPort;
	const char				*strLoginUser;
	const char				*strLoginPwd;
	const char				*strDevIMEI;
	const char				*strDevIMSI;
}CLOAD_PLAT_CONF,*PCLOAD_CONF_CONF;



/*
 ************************************************************************************************************************************************************************     
 *函数名称: ZFY_CloadServerStatus
 *功能描述: 平台协议模块状态查询
 *输入描述: 无
 *输出描述: 无
 *返回描述: 无
 *作者日期: LJJ/2024/12/02
 *全局声明: sCloadTcpServer
 *特殊说明: 无
 ************************************************************************************************************************************************************************       
*/
extern BOOL ZFY_CloadServerStatus(BOOL *pIsAlive, BOOL *pIsLogin);

/*
 ************************************************************************************************************************************************************************     
 *函数名称: ZFY_CloadServerOpen
 *功能描述: 平台协议模块打开
 *输入描述: 配置参数
 *输出描述: 无
 *返回描述: 无
 *作者日期: LJJ/2024/12/02
 *全局声明: sCloadTcpServerMutex,sCloadTcpServer
 *特殊说明: 无
 ************************************************************************************************************************************************************************       
*/
extern BOOL ZFY_CloadServerOpen(PCLOAD_CONF_CONF pConf);

/*
 ************************************************************************************************************************************************************************     
 *函数名称: ZFY_CloadServerClose
 *功能描述: 平台协议模块关闭
 *输入描述: 无
 *输出描述: 无
 *返回描述: 无
 *作者日期: LJJ/2024/12/02
 *全局声明: sCloadTcpServerMutex,sCloadTcpServer
 *特殊说明: 无
 ************************************************************************************************************************************************************************       
*/
extern void ZFY_CloadServerClose(void);


#ifdef	__cplusplus
#if		__cplusplus
}
#endif
#endif

/****************************************************************************zfy_Platform.h******************************************************************************************************/
#endif